app/Controllers/AdministradorController.php

    public function admin()
    {
        if (session()->get('ID_Rol') != 4) {
            return redirect()->to(base_url('login'));
        }
        $model = new UsuarioModel();
        $data['usuarios'] = $model->findAll();
---
SELECT *
FROM `usuario`

    public function admin_editar_usuario($id)
    {
        $model = new UsuarioModel();
        helper(['form']);
        $usuario = $model->find($id);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`ID` = '2'

    public function admin_comunidad()
    {
        $model = new ComunidadModel();
        $data['comunidades'] = $model->findAll();
---
SELECT *
FROM `comunidad`