app/Controllers/AuthController.php

    public function register()
    {

        $data['roles'] = $this->rolModel->findAll();
        $data['comunidades'] = $this->comunidadModel->findAll();
---
SELECT *
FROM `comunidad`

    public function do_login()
{
    helper(['form']);

    if ($this->request->getMethod() == 'POST') {
        $rules = [
            'Correo_electronico' => 'required|valid_email',
            'Contrasena' => 'required'
        ];

        if ($this->validate($rules)) {
            $correo = $this->request->getPost('Correo_electronico');
            $contrasena = $this->request->getPost('Contrasena');

            // Buscar el usuario por correo electrónico
            $usuario = $this->usuarioModel->where('Correo_electronico', $correo)->first();
---
SELECT *
FROM `usuario`
WHERE `Correo_electronico` = 'artesano@mail.com'
 LIMIT 1