app/Controllers/Home.php

    public function index(): string
    {
        $tieneProductoModel = new TieneProductoModel();
        $productosall = $tieneProductoModel->findAll();
        $tieneProductoModel = new TieneProductoModel();
        $contenidoModel = new ContenidoModel();
        $categoriaModel = new CategoriaModel();
        $detalleCompraModel = new CompraModel();
        $productos = $tieneProductoModel->getProductosTienda();
        $contenido = $contenidoModel->findAll();
        $categoria = $categoriaModel->findAll();
---
SELECT *
FROM `tiene_producto`
SELECT *
FROM `categoria`