app/Views/global/footer.php

                    use
                    App\Models\CategoriaModel;
                    $categoriaModel = new CategoriaModel();
                    $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`