app/Views/global/homeProducto.php

                $count++;
                $productoModel = new ProductoModel();
                $usuarioModel = new UsuarioModel();
                $prod = $productoModel->find($producto['ID_Producto']);
                $artesano = $usuarioModel->find($producto['ID_Artesano']);
---
SELECT *
FROM `producto`
WHERE `producto`.`ID` = '1'
SELECT *
FROM `usuario`
WHERE `usuario`.`ID` = '8'