app/Views/global/homeCategorias.php

                use App\Models\ProductoCategoriaModel;
                use App\Models\TieneProductoModel;
                $categoriaModel = new CategoriaModel();
                $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`

                    $productoCategoriaModel = new ProductoCategoriaModel();
                    $tieneProductoModel = new TieneProductoModel();

                    $producto = $productoCategoriaModel->where('ID_Categoria', $categoria['ID'])->findAll();
                    //$jjj=reset($producto);
                    //echo serialize($jjj);
                    foreach($producto as $prodC):
                        $prod = $tieneProductoModel->where('ID_Producto', $prodC['ID_Producto'])->findAll();
---
SELECT *
FROM `producto_categoria`
WHERE `ID_Categoria` = '1'
SELECT *
FROM `tiene_producto`
WHERE `ID_Producto` = '2'